MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8T1AHECBD/mcu.h
typedef struct                         /*!< (@ 0x40212000) R_GPT_POEG0 Structure                                      */
{
    union
    {
        __IOM uint32_t POEGG;          /*!< (@ 0x00000000) POEG Group Setting Register                                */

        struct
        {
            __IOM uint32_t PIDF  : 1;  /*!< [0..0] Port Input Detection Flag                                          */
            __IOM uint32_t IOCF  : 1;  /*!< [1..1] Real Time Overcurrent Detection Flag                               */
            __IOM uint32_t OSTPF : 1;  /*!< [2..2] Oscillation Stop Detection Flag                                    */
            __IOM uint32_t SSF   : 1;  /*!< [3..3] Software Stop Flag                                                 */
            __IOM uint32_t PIDE  : 1;  /*!< [4..4] Port Input Detection Enable. Note: Can be modified only
                                        *   once after a reset.                                                       */
            __IOM uint32_t IOCE : 1;   /*!< [5..5] Enable for GPT Output-Disable Request. Note: Can be modified
                                        *   only once after a reset.                                                  */
            __IOM uint32_t OSTPE : 1;  /*!< [6..6] Oscillation Stop Detection Enable. Note: Can be modified
                                        *   only once after a reset.                                                  */
            uint32_t             : 1;
            __IOM uint32_t CDRE0 : 1;  /*!< [8..8] Comparator Disable Request Enable. Note: Can be modified
                                        *   only once after a reset.                                                  */
            __IOM uint32_t CDRE1 : 1;  /*!< [9..9] Comparator Disable Request Enable. Note: Can be modified
                                        *   only once after a reset.                                                  */
            __IOM uint32_t CDRE2 : 1;  /*!< [10..10] Comparator Disable Request Enable. Note: Can be modified
                                        *   only once after a reset.                                                  */
            __IOM uint32_t CDRE3 : 1;  /*!< [11..11] Comparator Disable Request Enable. Note: Can be modified
                                        *   only once after a reset.                                                  */
            __IOM uint32_t CDRE4 : 1;  /*!< [12..12] Comparator Disable Request Enable. Note: Can be modified
                                        *   only once after a reset.                                                  */
            __IOM uint32_t CDRE5 : 1;  /*!< [13..13] Comparator Disable Request Enable. Note: Can be modified
                                        *   only once after a reset.                                                  */
            uint32_t            : 2;
            __IM uint32_t ST    : 1;   /*!< [16..16] GTETRG Input Status Flag                                         */
            uint32_t            : 11;
            __IOM uint32_t INV  : 1;   /*!< [28..28] GTETRG Input Reverse                                             */
            __IOM uint32_t NFEN : 1;   /*!< [29..29] Noise Filter Enable                                              */
            __IOM uint32_t NFCS : 2;   /*!< [31..30] Noise Filter Clock Select                                        */
        } POEGG_b;
    };
    __IM uint32_t RESERVED[15];

    union
    {
        __IOM uint16_t GTONCWP;        /*!< (@ 0x00000040) GPT Output Stopping Control Group Write Protection
                                        *                  Register                                                   */

        struct
        {
            __IOM uint16_t WP    : 1;  /*!< [0..0] Register Writing Disable                                           */
            uint16_t             : 7;
            __IOM uint16_t PRKEY : 8;  /*!< [15..8] Key Code                                                          */
        } GTONCWP_b;
    };
    __IM uint16_t RESERVED1;

    union
    {
        __IOM uint16_t GTONCCR;        /*!< (@ 0x00000044) GPT Output Stopping Control Group Controlling
                                        *                  Register                                                   */

        struct
        {
            __IOM uint16_t NE  : 1;    /*!< [0..0] Direct Stopping Request Setting                                    */
            uint16_t           : 3;
            __IOM uint16_t NFS : 4;    /*!< [7..4] Direct Stopping Request Selection                                  */
            __IOM uint16_t NFV : 1;    /*!< [8..8] Direct Stopping Request Active Sense                               */
            uint16_t           : 7;
        } GTONCCR_b;
    };
    __IM uint16_t RESERVED2;
} R_GPT_POEG0_Type;                    /*!< Size = 72 (0x48)                                                          */

/* =========================================================================================================================== */
/* ================                                           R_ICU                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief Interrupt Controller Unit (R_ICU)
 */

typedef struct                         /*!< (@ 0x40006000) R_ICU Structure                                            */
{
    union
    {
        __IOM uint8_t IRQCR[16];       /*!< (@ 0x00000000) IRQ Control Register [0..15]                               */

        struct
        {
            __IOM uint8_t IRQMD   : 2; /*!< [1..0] IRQ Detection Sense Select                                         */
            uint8_t               : 2;
            __IOM uint8_t FCLKSEL : 2; /*!< [5..4] IRQ Digital Filter Sampling Clock Select                           */
            uint8_t               : 1;
            __IOM uint8_t FLTEN   : 1; /*!< [7..7] IRQ Digital Filter Enable                                          */
        } IRQCR_b[16];
    };

    union
    {
        __IM uint8_t NMICR;             /*!< (@ 0x00000010) NMI Pin Interrupt Control Register                         */

        struct
        {
            __IOM uint8_t NMIMD    : 1; /*!< [0..0] NMI Detection Set                                                  */
            uint8_t                : 3;
            __IOM uint8_t NFCLKSEL : 2; /*!< [5..4] NMI Digital Filter Sampling Clock                                  */
            uint8_t                : 1;
            __IOM uint8_t NFLTEN   : 1; /*!< [7..7] NMI Digital Filter Enable                                          */
        } NMICR_b;
    };
    __IM uint8_t  RESERVED;
    __IM uint16_t RESERVED1;
    __IM uint32_t RESERVED2[6143];

    union
    {
        __IOM uint8_t SWIRQ_S;         /*!< (@ 0x00006010) Software Interrupt Request Register for Secure
                                        *                  Interrupt                                                  */

        struct
        {
            __IOM uint8_t SWIRQS : 1;  /*!< [0..0] Generates an interrupt for the other CPU subsystem.                */
            uint8_t              : 7;
        } SWIRQ_S_b;
    };
    __IM uint8_t  RESERVED3;
    __IM uint16_t RESERVED4;
    __IM uint32_t RESERVED5[3];

    union
    {
        __IOM uint8_t SWIRQ_NS;        /*!< (@ 0x00006020) Software Interrupt Request Register for Non-secure
                                        *                  Interrupt                                                  */

        struct
        {
            __IOM uint8_t SWIRQNS : 1; /*!< [0..0] Generates an interrupt for the other CPU subsystem.                */
            uint8_t               : 7;
        } SWIRQ_NS_b;
    };
    __IM uint8_t  RESERVED6;
    __IM uint16_t RESERVED7;
    __IM uint32_t RESERVED8[15];

    union
    {
        __IOM uint16_t IENMIER;        /*!< (@ 0x00006060) Integrated Error NMI Interrupt Enable Registe
                                        *                  for CPU                                                    */

        struct
        {
            __IOM uint16_t CMEN  : 1;  /*!< [0..0] Integrated Common Memory error nmi Enable                          */
            __IOM uint16_t LMEN  : 1;  /*!< [1..1] Integrated Local Memory error nmi Enable                           */
            __IOM uint16_t BUSEN : 1;  /*!< [2..2] Integrated BUS error nmi Enable                                    */
            uint16_t             : 13;
        } IENMIER_b;
    };
    __IM uint16_t RESERVED9;
    __IM uint32_t RESERVED10[39];

    union
    {
        __IOM uint16_t NMIER;          /*!< (@ 0x00006100) Non-Maskable Interrupt Enable Register                     */

        struct
        {
            __IOM uint16_t IWDTEN : 1; /*!< [0..0] IWDT Underflow/Refresh Error Interrupt Enable                      */
            __IOM uint16_t WDTEN  : 1; /*!< [1..1] WDT Underflow/Refresh Error Interrupt Enable                       */
            __IOM uint16_t LVD1EN : 1; /*!< [2..2] Voltage-Monitoring 1 Interrupt Enable                              */
            __IOM uint16_t LVD2EN : 1; /*!< [3..3] Voltage-Monitoring 2 Interrupt Enable                              */
            uint16_t              : 2;
            __IOM uint16_t OSTEN  : 1; /*!< [6..6] Oscillation Stop Detection Interrupt Enable                        */
            __IOM uint16_t NMIEN  : 1; /*!< [7..7] NMI Pin Interrupt Enable                                           */
            uint16_t              : 4;
            __IOM uint16_t BUSEN  : 1; /*!< [12..12] BUS error Interrupt Enable                                       */
            __IOM uint16_t CMEN   : 1; /*!< [13..13] Common Memory error Interrupt Enable                             */
            uint16_t              : 1;
            __IOM uint16_t LUEN   : 1; /*!< [15..15] LockUp Interrupt Enable                                          */
        } NMIER_b;
    };
    __IM uint16_t RESERVED11;
    __IM uint32_t RESERVED12[3];

    union
    {
        __IOM uint16_t NMICLR;          /*!< (@ 0x00006110) Non-Maskable Interrupt Status Clear Register               */

        struct
        {
            __IOM uint16_t IWDTCLR : 1; /*!< [0..0] IWDT Clear                                                         */
            __IOM uint16_t WDTCLR  : 1; /*!< [1..1] WDT Clear                                                          */
            __IOM uint16_t LVD1CLR : 1; /*!< [2..2] PVD1 Clear                                                         */
            __IOM uint16_t LVD2CLR : 1; /*!< [3..3] PVD2 Clear                                                         */
            uint16_t               : 2;
            __IOM uint16_t OSTCLR  : 1; /*!< [6..6] OST Clear                                                          */
            __IOM uint16_t NMICLR  : 1; /*!< [7..7] NMI Clear                                                          */
            uint16_t               : 4;
            __IOM uint16_t BUSCLR  : 1; /*!< [12..12] Bus Clear                                                        */
            __IOM uint16_t CMCLR   : 1; /*!< [13..13] CM Clear                                                         */
            uint16_t               : 1;
            __IOM uint16_t LUCLR   : 1; /*!< [15..15] LU Clear                                                         */
        } NMICLR_b;
    };
    __IM uint16_t RESERVED13;
    __IM uint32_t RESERVED14[3];

    union
    {
        __IM uint16_t NMISR;           /*!< (@ 0x00006120) Non-Maskable Interrupt Status Register                     */

        struct
        {
            __IM uint16_t IWDTST : 1;  /*!< [0..0] IWDT Underflow/Refresh Error Status Flag                           */
            __IM uint16_t WDTST  : 1;  /*!< [1..1] WDT Underflow/Refresh Error Status Flag                            */
            __IM uint16_t LVD1ST : 1;  /*!< [2..2] Voltage-Monitoring 1 Interrupt Status Flag                         */
            __IM uint16_t LVD2ST : 1;  /*!< [3..3] Voltage-Monitoring 2 Interrupt Status Flag                         */
            uint16_t             : 2;
            __IM uint16_t OSTST  : 1;  /*!< [6..6] Oscillation Stop Detection Interrupt Status Flag                   */
            __IM uint16_t NMIST  : 1;  /*!< [7..7] NMI Status Flag                                                    */
            uint16_t             : 4;
            __IM uint16_t BUSST  : 1;  /*!< [12..12] BUS error Interrupt Status Flag                                  */
            __IM uint16_t CMST   : 1;  /*!< [13..13] Common Memory error Interrupt Status Flag                        */
            uint16_t             : 1;
            __IM uint16_t LUST   : 1;  /*!< [15..15] LockUp Interrupt Status Flag                                     */
        } NMISR_b;
    };
    __IM uint16_t RESERVED15;
    __IM uint32_t RESERVED16[31];

    union
    {
        __IOM uint32_t WUPEN;               /*!< (@ 0x000061A0) Wake Up Interrupt Enable Register                          */

        struct
        {
            __IOM uint32_t IRQWUPEN0 : 1;   /*!< [0..0] IRQ0 Interrupt Deep Sleep/Software Standby Returns Enable
                                             *   bit                                                                       */
            __IOM uint32_t IRQWUPEN1 : 1;   /*!< [1..1] IRQ1 Interrupt Deep Sleep/Software Standby Returns Enable
                                             *   bit                                                                       */
            __IOM uint32_t IRQWUPEN2 : 1;   /*!< [2..2] IRQ2 Interrupt Deep Sleep/Software Standby Returns Enable
                                             *   bit                                                                       */
            __IOM uint32_t IRQWUPEN3 : 1;   /*!< [3..3] IRQ3 Interrupt Deep Sleep/Software Standby Returns Enable
                                             *   bit                                                                       */
            __IOM uint32_t IRQWUPEN4 : 1;   /*!< [4..4] IRQ4 Interrupt Deep Sleep/Software Standby Returns Enable
                                             *   bit                                                                       */
            __IOM uint32_t IRQWUPEN5 : 1;   /*!< [5..5] IRQ5 Interrupt Deep Sleep/Software Standby Returns Enable
                                             *   bit                                                                       */
            __IOM uint32_t IRQWUPEN6 : 1;   /*!< [6..6] IRQ6 Interrupt Deep Sleep/Software Standby Returns Enable
                                             *   bit                                                                       */
            __IOM uint32_t IRQWUPEN7 : 1;   /*!< [7..7] IRQ7 Interrupt Deep Sleep/Software Standby Returns Enable
                                             *   bit                                                                       */
            __IOM uint32_t IRQWUPEN8 : 1;   /*!< [8..8] IRQ8 Interrupt Deep Sleep/Software Standby Returns Enable
                                             *   bit                                                                       */
            __IOM uint32_t IRQWUPEN9 : 1;   /*!< [9..9] IRQ9 Interrupt Deep Sleep/Software Standby Returns Enable
                                             *   bit                                                                       */
            __IOM uint32_t IRQWUPEN10 : 1;  /*!< [10..10] IRQ10 Interrupt Deep Sleep/Software Standby Returns
                                             *   Enable bit                                                                */
            __IOM uint32_t IRQWUPEN11 : 1;  /*!< [11..11] IRQ11 Interrupt Deep Sleep/Software Standby Returns
                                             *   Enable bit                                                                */
            __IOM uint32_t IRQWUPEN12 : 1;  /*!< [12..12] IRQ12 Interrupt Deep Sleep/Software Standby Returns
                                             *   Enable bit                                                                */
            __IOM uint32_t IRQWUPEN13 : 1;  /*!< [13..13] IRQ13 Interrupt Deep Sleep/Software Standby Returns
                                             *   Enable bit                                                                */
            __IOM uint32_t IRQWUPEN14 : 1;  /*!< [14..14] IRQ14 Interrupt Deep Sleep/Software Standby Returns
                                             *   Enable bit                                                                */
            __IOM uint32_t IRQWUPEN15 : 1;  /*!< [15..15] IRQ15 Interrupt Deep Sleep/Software Standby Returns
                                             *   Enable bit                                                                */
            __IOM uint32_t IWDTWUPEN : 1;   /*!< [16..16] IWDT Interrupt Deep Sleep/Software Standby Returns
                                             *   Enable bit                                                                */
            uint32_t                 : 1;
            __IOM uint32_t LVD1WUPEN : 1;   /*!< [18..18] PVD1 Interrupt Deep Sleep/Software Standby Returns
                                             *   Enable bit                                                                */
            __IOM uint32_t LVD2WUPEN : 1;   /*!< [19..19] PVD2 Interrupt Deep Sleep/Software Standby Returns
                                             *   Enable bit                                                                */
            __IOM uint32_t VBATTWUPEN : 1;  /*!< [20..20] VBATT Monitor Interrupt Deep Sleep/Software Standby
                                             *   Returns Enable bit                                                        */
            uint32_t                   : 3;
            __IOM uint32_t RTCALMWUPEN : 1; /*!< [24..24] RTC Alarm Interrupt Deep Sleep/Software Standby Returns
                                             *   Enable bit                                                                */
            __IOM uint32_t RTCPRDWUPEN : 1; /*!< [25..25] RCT Period Interrupt Deep Sleep/Software Standby Returns
                                             *   Enable bit                                                                */
            __IOM uint32_t USBHSWUPEN : 1;  /*!< [26..26] USBHS Interrupt Deep Sleep/Software Standby Returns
                                             *   Enable bit                                                                */
            __IOM uint32_t USBFSWUPEN : 1;  /*!< [27..27] USBFS0 Interrupt Deep Sleep/Software Standby Returns
                                             *   Enable bit                                                                */
            __IOM uint32_t AGT1UDWUPEN : 1; /*!< [28..28] AGT1 Underflow Interrupt Deep Sleep/Software Standby
                                             *   Returns Enable bit                                                        */
            __IOM uint32_t AGT1CAWUPEN : 1; /*!< [29..29] AGT1 Compare Match A Interrupt Deep Sleep/Software
                                             *   Standby Returns Enable bit                                                */
            __IOM uint32_t AGT1CBWUPEN : 1; /*!< [30..30] AGT1 Compare Match B Interrupt Deep Sleep/Software
                                             *   Standby Returns Enable bit                                                */
            __IOM uint32_t RIIC0WUPEN : 1;  /*!< [31..31] RIIC0 Address Match Interrupt Deep Sleep/Software Standby
                                             *   Returns Enable bit                                                        */
        } WUPEN_b;
    };

    union
    {
        __IOM uint32_t WUPEN1;         /*!< (@ 0x000061A4) Wake Up Interrupt Enable Register 1                        */

        struct
        {
            uint32_t                    : 3;
            __IOM uint32_t COMPHS0WUPEN : 1; /*!< [3..3] Comparator-HS0 Interrupt Deep Sleep/Software Standby
                                              *   Returns Enable bit                                                        */
            uint32_t                  : 4;
            __IOM uint32_t ULP0UWUPEN : 1;   /*!< [8..8] ULPT0 Underflow Interrupt Deep Sleep/Software Standby
                                              *   Returns Enable bit                                                        */
            __IOM uint32_t ULP0AWUPEN : 1;   /*!< [9..9] ULPT0 Compare Match A Interrupt Deep Sleep/Software Standby
                                              *   Returns Enable bit                                                        */
            __IOM uint32_t ULP0BWUPEN : 1;   /*!< [10..10] ULPT0 Compare Match B Interrupt Deep Sleep/Software
                                              *   Standby Returns Enable bit                                                */
            __IOM uint32_t I3CWUPEN : 1;     /*!< [11..11] I3C Wakeup Condition Detection Interrupt Deep Sleep/Software
                                              *   Standby Returns Enable bit                                                */
            __IOM uint32_t ULP1UWUPEN : 1;   /*!< [12..12] ULPT1 Underflow Interrupt Deep Sleep/Software Standby
                                              *   Returns Enable bit                                                        */
            __IOM uint32_t ULP1AWUPEN : 1;   /*!< [13..13] ULPT1 Compare Match A Interrupt Deep Sleep/Software
                                              *   Standby Returns Enable bit                                                */
            __IOM uint32_t ULP1BWUPEN : 1;   /*!< [14..14] ULPT1 Compare Match B Interrupt Deep Sleep/Software
                                              *   Standby Returns Enable bit                                                */
            uint32_t : 17;
        } WUPEN1_b;
    };
    __IM uint32_t RESERVED17[86];

    union
    {
        __IOM uint32_t IELSR[96];      /*!< (@ 0x00006300) ICU Event Link Setting Register [0..95]                    */

        struct
        {
            __IOM uint32_t IELS : 9;   /*!< [8..0] ICU Event selection to NVICSet the number for the event
                                        *   signal to be linked .                                                     */
            uint32_t            : 7;
            __IOM uint32_t IR   : 1;   /*!< [16..16] Interrupt Status Flag                                            */
            uint32_t            : 7;
            __IOM uint32_t DTCE : 1;   /*!< [24..24] DTC Activation Enable                                            */
            uint32_t            : 7;
        } IELSR_b[96];
    };
} R_ICU_Type;                          /*!< Size = 25728 (0x6480)                                                     */

/* =========================================================================================================================== */
/* ================                                          R_IIC0                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief I2C Bus Interface (R_IIC0)
 */

typedef struct                         /*!< (@ 0x4025E000) R_IIC0 Structure                                           */
{
    union
    {
        __IOM uint8_t ICCR1;           /*!< (@ 0x00000000) I2C Bus Control Register 1                                 */

