MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8T1AHECBD/mcu.h
/* =======================================================  VBTBKR14  ======================================================== */
 #define R_SYSTEM_VBTBKR14_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR14_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR15  ======================================================== */
 #define R_SYSTEM_VBTBKR15_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR15_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR16  ======================================================== */
 #define R_SYSTEM_VBTBKR16_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR16_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR17  ======================================================== */
 #define R_SYSTEM_VBTBKR17_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR17_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR18  ======================================================== */
 #define R_SYSTEM_VBTBKR18_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR18_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR19  ======================================================== */
 #define R_SYSTEM_VBTBKR19_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR19_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR20  ======================================================== */
 #define R_SYSTEM_VBTBKR20_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR20_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR21  ======================================================== */
 #define R_SYSTEM_VBTBKR21_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR21_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR22  ======================================================== */
 #define R_SYSTEM_VBTBKR22_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR22_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR23  ======================================================== */
 #define R_SYSTEM_VBTBKR23_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR23_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR24  ======================================================== */
 #define R_SYSTEM_VBTBKR24_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR24_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR25  ======================================================== */
 #define R_SYSTEM_VBTBKR25_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR25_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR26  ======================================================== */
 #define R_SYSTEM_VBTBKR26_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR26_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR27  ======================================================== */
 #define R_SYSTEM_VBTBKR27_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR27_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR28  ======================================================== */
 #define R_SYSTEM_VBTBKR28_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR28_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR29  ======================================================== */
 #define R_SYSTEM_VBTBKR29_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR29_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR30  ======================================================== */
 #define R_SYSTEM_VBTBKR30_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR30_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR31  ======================================================== */
 #define R_SYSTEM_VBTBKR31_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR31_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR32  ======================================================== */
 #define R_SYSTEM_VBTBKR32_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR32_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR33  ======================================================== */
 #define R_SYSTEM_VBTBKR33_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR33_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR34  ======================================================== */
 #define R_SYSTEM_VBTBKR34_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR34_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR35  ======================================================== */
 #define R_SYSTEM_VBTBKR35_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR35_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR36  ======================================================== */
 #define R_SYSTEM_VBTBKR36_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR36_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR37  ======================================================== */
 #define R_SYSTEM_VBTBKR37_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR37_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR38  ======================================================== */
 #define R_SYSTEM_VBTBKR38_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR38_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR39  ======================================================== */
 #define R_SYSTEM_VBTBKR39_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR39_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR40  ======================================================== */
 #define R_SYSTEM_VBTBKR40_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR40_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR41  ======================================================== */
 #define R_SYSTEM_VBTBKR41_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR41_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR42  ======================================================== */
 #define R_SYSTEM_VBTBKR42_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR42_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR43  ======================================================== */
 #define R_SYSTEM_VBTBKR43_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR43_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR44  ======================================================== */
 #define R_SYSTEM_VBTBKR44_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR44_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR45  ======================================================== */
 #define R_SYSTEM_VBTBKR45_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR45_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR46  ======================================================== */
 #define R_SYSTEM_VBTBKR46_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR46_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR47  ======================================================== */
 #define R_SYSTEM_VBTBKR47_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR47_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR48  ======================================================== */
 #define R_SYSTEM_VBTBKR48_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR48_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR49  ======================================================== */
 #define R_SYSTEM_VBTBKR49_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR49_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR50  ======================================================== */
 #define R_SYSTEM_VBTBKR50_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR50_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR51  ======================================================== */
 #define R_SYSTEM_VBTBKR51_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR51_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR52  ======================================================== */
 #define R_SYSTEM_VBTBKR52_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR52_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR53  ======================================================== */
 #define R_SYSTEM_VBTBKR53_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR53_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR54  ======================================================== */
 #define R_SYSTEM_VBTBKR54_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR54_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR55  ======================================================== */
 #define R_SYSTEM_VBTBKR55_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR55_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR56  ======================================================== */
 #define R_SYSTEM_VBTBKR56_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR56_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR57  ======================================================== */
 #define R_SYSTEM_VBTBKR57_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR57_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR58  ======================================================== */
 #define R_SYSTEM_VBTBKR58_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR58_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR59  ======================================================== */
 #define R_SYSTEM_VBTBKR59_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR59_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR60  ======================================================== */
 #define R_SYSTEM_VBTBKR60_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR60_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR61  ======================================================== */
 #define R_SYSTEM_VBTBKR61_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR61_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR62  ======================================================== */
 #define R_SYSTEM_VBTBKR62_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR62_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR63  ======================================================== */
 #define R_SYSTEM_VBTBKR63_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR63_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR64  ======================================================== */
 #define R_SYSTEM_VBTBKR64_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR64_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR65  ======================================================== */
 #define R_SYSTEM_VBTBKR65_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR65_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR66  ======================================================== */
 #define R_SYSTEM_VBTBKR66_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR66_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR67  ======================================================== */
 #define R_SYSTEM_VBTBKR67_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR67_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR68  ======================================================== */
 #define R_SYSTEM_VBTBKR68_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR68_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR69  ======================================================== */
 #define R_SYSTEM_VBTBKR69_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR69_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR70  ======================================================== */
 #define R_SYSTEM_VBTBKR70_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR70_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR71  ======================================================== */
 #define R_SYSTEM_VBTBKR71_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR71_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR72  ======================================================== */
 #define R_SYSTEM_VBTBKR72_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR72_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR73  ======================================================== */
 #define R_SYSTEM_VBTBKR73_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR73_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR74  ======================================================== */
 #define R_SYSTEM_VBTBKR74_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR74_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR75  ======================================================== */
 #define R_SYSTEM_VBTBKR75_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR75_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR76  ======================================================== */
 #define R_SYSTEM_VBTBKR76_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
